Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# DataOp_BitFill
source: Inserted bit value
ar: قيمة البتات المدرجة
cs: Hodnota vkládaných bitů
de: Wert der eingefügten Bits
el: Τιμή εισαγόμενων bit
es: Valor de los bits insertados
fa: مقدار بیت‌های درج‌شده
fr: Valeur des bits insérés
hu: Beszúrt bit értéke
id: Nilai bit yang disisipkan
it: Valore dei bit inseriti
ja: 埋める値
ko: 삽입할 비트 값
pl: Wartość wstawianych bitów
pt: Valor dos bits inseridos
ro: Valoarea biților inserați
th: ค่าบิตที่แทรก
tr: Eklenen bit değeri
uk: Значення вставлених бітів
vi: Giá trị bit được chèn
zh_hans: 插入的位值
zh_hant: 插入的位元值

# DataOp_BitOrder
source: Bit order
ar: ترتيب البتات
cs: Pořadí bitů
de: Bitreihenfolge
el: Σειρά bit
es: Orden de bits
fa: ترتیب بیت
fr: Ordre des bits
hu: Bitsorrend
id: Urutan bit
it: Ordine dei bit
ja: ビットの並び順
ko: 비트 순서
pl: Kolejność bitów
pt: Ordem dos bits
ro: Ordinea biților
th: ลำดับบิต
tr: Bit sırası
uk: Порядок бітів
vi: Thứ tự bit
zh_hans: 位顺序
zh_hant: 位元順序

# DataOp_BitOrder_Msb
source: Most significant bit first
ar: البت الأعلى أهمية أولاً
cs: Nejvyšší bit první
de: Höchstwertiges Bit zuerst
el: Πρώτα το σημαντικότερο bit
es: Bit más significativo primero
fa: ابتدا پرارزش‌ترین بیت
fr: Bit de poids fort en premier
hu: Legmagasabb helyiértékű bit elöl
id: Bit paling signifikan dahulu
it: Prima il bit più significativo
ja: 最上位ビットから
ko: 최상위 비트부터
pl: Najpierw najbardziej znaczący bit
pt: Bit mais significativo primeiro
ro: Întâi bitul cel mai semnificativ
th: บิตที่สำคัญที่สุดก่อน
tr: Önce en anlamlı bit
uk: Спочатку старший біт
vi: Bit cao nhất trước
zh_hans: 最高有效位优先
zh_hant: 最高有效位元優先

# DataOp_BitOrder_Lsb
source: Least significant bit first
ar: البت الأدنى أهمية أولاً
cs: Nejnižší bit první
de: Niederwertigstes Bit zuerst
el: Πρώτα το λιγότερο σημαντικό bit
es: Bit menos significativo primero
fa: ابتدا کم‌ارزش‌ترین بیت
fr: Bit de poids faible en premier
hu: Legalacsonyabb helyiértékű bit elöl
id: Bit paling tidak signifikan dahulu
it: Prima il bit meno significativo
ja: 最下位ビットから
ko: 최하위 비트부터
pl: Najpierw najmniej znaczący bit
pt: Bit menos significativo primeiro
ro: Întâi bitul cel mai puțin semnificativ
th: บิตที่สำคัญน้อยที่สุดก่อน
tr: Önce en az anlamlı bit
uk: Спочатку молодший біт
vi: Bit thấp nhất trước
zh_hans: 最低有效位优先
zh_hant: 最低有效位元優先

# DataOp_BitScope
source: Shift
ar: الإزاحة
cs: Posunout
de: Verschieben
el: Μετατόπιση
es: Desplazar
fa: جابه‌جایی
fr: Décaler
hu: Eltolási terület
id: Geser
it: Scorrimento
ja: ずらす範囲
ko: 이동 범위
pl: Przesuwanie
pt: Deslocamento
ro: Deplasare
th: เลื่อน
tr: Kaydır
uk: Зсув
vi: Dịch
zh_hans: 移动
zh_hant: 位移範圍

# DataOp_BitScope_Selection
source: Within the selection only
ar: داخل التحديد فقط
cs: Jen v rámci výběru
de: Nur innerhalb der Auswahl
el: Μόνο μέσα στην επιλογή
es: Solo dentro de la selección
fa: فقط درون انتخاب
fr: Uniquement dans la sélection
hu: Csak a kijelölésen belül
id: Hanya di dalam pilihan
it: Solo all'interno della selezione
ja: 選択範囲の中だけ
ko: 선택 영역 안에서만
pl: Tylko w obrębie zaznaczenia
pt: Somente dentro da seleção
ro: Doar în cadrul selecției
th: เฉพาะภายในส่วนที่เลือก
tr: Yalnızca seçim içinde
uk: Лише всередині виділення
vi: Chỉ trong vùng chọn
zh_hans: 仅在选定内容内
zh_hant: 只在選取範圍內

# DataOp_BitScope_ToEnd
source: To the end of the document
ar: حتى نهاية المستند
cs: Do konce dokumentu
de: Bis zum Ende des Dokuments
el: Έως το τέλος του εγγράφου
es: Hasta el final del documento
fa: تا پایان سند
fr: Jusqu'à la fin du document
hu: A dokumentum végéig
id: Sampai akhir dokumen
it: Fino alla fine del documento
ja: ドキュメントの末尾まで
ko: 문서 끝까지
pl: Do końca dokumentu
pt: Até o fim do documento
ro: Până la sfârșitul documentului
th: จนถึงจุดสิ้นสุดของเอกสาร
tr: Belgenin sonuna kadar
uk: До кінця документа
vi: Đến cuối tài liệu
zh_hans: 到文档末尾
zh_hant: 到文件結尾

# DataOp_Preview
source: Preview (first 64 bytes)
ar: معاينة (أول 64 بايت)
cs: Náhled (prvních 64 bajtů)
de: Vorschau (erste 64 Bytes)
el: Προεπισκόπηση (πρώτα 64 byte)
es: Vista previa (primeros 64 bytes)
fa: پیش‌نمایش (64 بایت نخست)
fr: Aperçu (64 premiers octets)
hu: Előnézet (első 64 bájt)
id: Pratinjau (64 byte pertama)
it: Anteprima (primi 64 byte)
ja: プレビュー (先頭 64 バイト)
ko: 미리 보기(처음 64바이트)
pl: Podgląd (pierwsze 64 bajty)
pt: Visualização (primeiros 64 bytes)
ro: Previzualizare (primii 64 de octeți)
th: ตัวอย่าง (64 ไบต์แรก)
tr: Önizleme (ilk 64 bayt)
uk: Попередній перегляд (перші 64 байти)
vi: Xem trước (64 byte đầu)
zh_hans: 预览（前 64 字节）
zh_hant: 預覽（前 64 個位元組）

# DataOp_PreviewBeforeLine
source: Before: {0}
ar: قبل: {0}
cs: Před: {0}
de: Vorher: {0}
el: Πριν: {0}
es: Antes: {0}
fa: پیش از: {0}
fr: Avant : {0}
hu: Előtte: {0}
id: Sebelum: {0}
it: Prima: {0}
ja: 変更前: {0}
ko: 이전: {0}
pl: Przed: {0}
pt: Antes: {0}
ro: Înainte: {0}
th: ก่อน: {0}
tr: Önce: {0}
uk: До: {0}
vi: Trước: {0}
zh_hans: 之前：{0}
zh_hant: 變更前：{0}

# DataOp_PreviewAfterLine
source: After: {0}
ar: بعد: {0}
cs: Po: {0}
de: Nachher: {0}
el: Μετά: {0}
es: Después: {0}
fa: پس از: {0}
fr: Après : {0}
hu: Utána: {0}
id: Sesudah: {0}
it: Dopo: {0}
ja: 変更後: {0}
ko: 이후: {0}
pl: Po: {0}
pt: Depois: {0}
ro: După: {0}
th: หลัง: {0}
tr: Sonra: {0}
uk: Після: {0}
vi: Sau: {0}
zh_hans: 之后：{0}
zh_hant: 變更後：{0}

# DataOp_ValuesBeforeLine
source: Values before: {0}
ar: القيم قبل: {0}
cs: Hodnoty před: {0}
de: Werte vorher: {0}
el: Τιμές πριν: {0}
es: Valores antes: {0}
fa: مقادیر پیش از: {0}
fr: Valeurs avant : {0}
hu: Értékek előtte: {0}
id: Nilai sebelum: {0}
it: Valori prima: {0}
ja: 変更前の値: {0}
ko: 이전 값: {0}
pl: Wartości przed: {0}
pt: Valores antes: {0}
ro: Valori înainte: {0}
th: ค่าก่อน: {0}
tr: Önceki değerler: {0}
uk: Значення до: {0}
vi: Giá trị trước: {0}
zh_hans: 之前的值：{0}
zh_hant: 變更前的值：{0}

# DataOp_ValuesAfterLine
source: Values after: {0}
ar: القيم بعد: {0}
cs: Hodnoty po: {0}
de: Werte nachher: {0}
el: Τιμές μετά: {0}
es: Valores después: {0}
fa: مقادیر پس از: {0}
fr: Valeurs après : {0}
hu: Értékek utána: {0}
id: Nilai sesudah: {0}
it: Valori dopo: {0}
ja: 変更後の値: {0}
ko: 이후 값: {0}
pl: Wartości po: {0}
pt: Valores depois: {0}
ro: Valori după: {0}
th: ค่าหลัง: {0}
tr: Sonraki değerler: {0}
uk: Значення після: {0}
vi: Giá trị sau: {0}
zh_hans: 之后的值：{0}
zh_hant: 變更後的值：{0}

# DataOp_ChangedCount
source: {0, plural, one {# byte changes} other {# bytes change}}
ar: {0, plural, zero {يتغير # بايت} one {يتغير بايت واحد} two {يتغير بايتان} few {تتغير # بايتات} many {يتغير # بايتًا} other {يتغير # بايت}}
cs: {0, plural, one {Změní se # bajt} few {Změní se # bajty} many {Změní se # bajtu} other {Změní se # bajtů}}
de: {0, plural, one {# Byte ändert sich} other {# Bytes ändern sich}}
el: {0, plural, one {Αλλάζει # byte} other {Αλλάζουν # byte}}
es: {0, plural, one {Cambia # byte} other {Cambian # bytes}}
fa: {0, plural, one {# بایت تغییر می‌کند} other {# بایت تغییر می‌کند}}
fr: {0, plural, one {# octet change} other {# octets changent}}
hu: {0, plural, one {# bájt módosul} other {# bájt módosul}}
id: {0, plural, other {# byte berubah}}
it: {0, plural, one {Cambia # byte} other {Cambiano # byte}}
ja: {0} バイトが変わります
ko: {0, plural, other {#바이트가 변경됩니다}}
pl: {0, plural, one {Zmienia się # bajt} few {Zmieniają się # bajty} many {Zmienia się # bajtów} other {Zmienia się # bajta}}
pt: {0, plural, one {# byte muda} other {# bytes mudam}}
ro: {0, plural, one {Se modifică # octet} few {Se modifică # octeți} other {Se modifică # de octeți}}
th: {0, plural, other {# ไบต์จะเปลี่ยน}}
tr: {0, plural, one {# bayt değişir} other {# bayt değişir}}
uk: {0, plural, one {Зміниться # байт} few {Зміняться # байти} many {Зміниться # байтів} other {Зміниться # байта}}
vi: {0, plural, other {# byte thay đổi}}
zh_hans: {0, plural, other {# 个字节将更改}}
zh_hant: {0, plural, other {將變更 # 個位元組}}

# DataOp_TrailingNote
source: {0, plural, one {The last # byte is shorter than an element and is not changed.} other {The last # bytes are shorter than an element and are not changed.}}
ar: {0, plural, zero {آخر # بايت أقصر من عنصر ولا يتم تغييره.} one {آخر بايت أقصر من عنصر ولا يتم تغييره.} two {آخر بايتين أقصر من عنصر ولا يتم تغييرهما.} few {آخر # بايتات أقصر من عنصر ولا يتم تغييرها.} many {آخر # بايتًا أقصر من عنصر ولا يتم تغييرها.} other {آخر # بايت أقصر من عنصر ولا يتم تغييرها.}}
cs: {0, plural, one {Poslední # bajt je kratší než prvek a nezmění se.} few {Poslední # bajty jsou kratší než prvek a nezmění se.} many {Posledních # bajtu je kratších než prvek a nezmění se.} other {Posledních # bajtů je kratších než prvek a nezmění se.}}
de: {0, plural, one {Das letzte # Byte ist kürzer als ein Element und wird nicht geändert.} other {Die letzten # Bytes sind kürzer als ein Element und werden nicht geändert.}}
el: {0, plural, one {Το τελευταίο # byte είναι μικρότερο από ένα στοιχείο και δεν αλλάζει.} other {Τα τελευταία # byte είναι μικρότερα από ένα στοιχείο και δεν αλλάζουν.}}
es: {0, plural, one {El último byte (#) es más corto que un elemento y no se cambia.} other {Los últimos # bytes son más cortos que un elemento y no se cambian.}}
fa: {0, plural, one {آخرین # بایت از یک عنصر کوتاه‌تر است و تغییر نمی‌کند.} other {آخرین # بایت از یک عنصر کوتاه‌ترند و تغییر نمی‌کنند.}}
fr: {0, plural, one {Le dernier octet (#) est plus court qu'un élément et n'est pas modifié.} other {Les # derniers octets sont plus courts qu'un élément et ne sont pas modifiés.}}
hu: {0, plural, one {Az utolsó # bájt rövidebb egy elemnél, ezért nem módosul.} other {Az utolsó # bájt rövidebb egy elemnél, ezért nem módosul.}}
id: {0, plural, other {# byte terakhir lebih pendek dari satu elemen dan tidak diubah.}}
it: {0, plural, one {L'ultimo # byte è più corto di un elemento e non viene modificato.} other {Gli ultimi # byte sono più corti di un elemento e non vengono modificati.}}
ja: 最後の {0} バイトは要素に満たないため変更しません。
ko: {0, plural, other {마지막 #바이트는 요소보다 짧으므로 변경하지 않습니다.}}
pl: {0, plural, one {Ostatni # bajt jest krótszy niż element i nie zostanie zmieniony.} few {Ostatnie # bajty są krótsze niż element i nie zostaną zmienione.} many {Ostatnich # bajtów jest krótszych niż element i nie zostaną zmienione.} other {Ostatnie # bajta są krótsze niż element i nie zostaną zmienione.}}
pt: {0, plural, one {O último # byte é menor que um elemento e não é alterado.} other {Os últimos # bytes são menores que um elemento e não são alterados.}}
ro: {0, plural, one {Ultimul # octet este mai scurt decât un element și nu se modifică.} few {Ultimii # octeți sunt mai scurți decât un element și nu se modifică.} other {Ultimii # de octeți sunt mai scurți decât un element și nu se modifică.}}
th: {0, plural, other {# ไบต์สุดท้ายสั้นกว่าหนึ่งองค์ประกอบและจะไม่ถูกเปลี่ยน}}
tr: {0, plural, one {Sondaki # bayt bir öğeden kısa olduğundan değiştirilmez.} other {Sondaki # bayt bir öğeden kısa olduğundan değiştirilmez.}}
uk: {0, plural, one {Останній # байт коротший за елемент і не змінюється.} few {Останні # байти коротші за елемент і не змінюються.} many {Останні # байтів коротші за елемент і не змінюються.} other {Останні # байта коротші за елемент і не змінюються.}}
vi: {0, plural, other {# byte cuối ngắn hơn một phần tử và không được thay đổi.}}
zh_hans: {0, plural, other {最后 # 个字节不足一个元素，不会更改。}}
zh_hant: {0, plural, other {最後 # 個位元組不足一個元素，因此不會變更。}}

# DataOp_RewriteNote
source: This rewrites {0} of data.
ar: يعيد هذا كتابة {0} من البيانات.
cs: Tím se přepíše {0} dat.
de: Dadurch werden {0} Daten neu geschrieben.
el: Επανεγγράφονται {0} δεδομένων.
es: Esto reescribe {0} de datos.
fa: این کار {0} داده را بازنویسی می‌کند.
fr: Cela réécrit {0} de données.
hu: Ez {0} adatot ír újra.
id: Ini menulis ulang {0} data.
it: Verranno riscritti {0} di dati.
ja: {0} のデータを書き直します。
ko: {0}의 데이터를 다시 씁니다.
pl: Spowoduje to ponowny zapis {0} danych.
pt: Isso regrava {0} de dados.
ro: Se rescriu {0} de date.
th: การดำเนินการนี้จะเขียนข้อมูล {0} ใหม่
tr: Bu işlem {0} veriyi yeniden yazar.
uk: Буде перезаписано {0} даних.
vi: Thao tác này ghi lại {0} dữ liệu.
zh_hans: 这将重写 {0} 的数据。
zh_hant: 這會重寫 {0} 的資料。

# DataOp_RewriteConfirm
source: This rewrites {0} GB of data (uses {0} GB of temporary space).
ar: يعيد هذا كتابة {0} GB من البيانات (يستخدم {0} GB من المساحة المؤقتة).
cs: Tím se přepíše {0} GB dat (použije se {0} GB dočasného místa).
de: Dadurch werden {0} GB Daten neu geschrieben (belegt {0} GB temporären Speicherplatz).
el: Επανεγγράφονται {0} GB δεδομένων (χρησιμοποιούνται {0} GB προσωρινού χώρου).
es: Esto reescribe {0} GB de datos (usa {0} GB de espacio temporal).
fa: این کار {0} GB داده را بازنویسی می‌کند ({0} GB فضای موقت استفاده می‌کند).
fr: Cela réécrit {0} Go de données (utilise {0} Go d'espace temporaire).
hu: Ez {0} GB adatot ír újra ({0} GB ideiglenes tárhelyet használ).
id: Ini menulis ulang {0} GB data (menggunakan {0} GB ruang sementara).
it: Verranno riscritti {0} GB di dati (usando {0} GB di spazio temporaneo).
ja: {0} GB のデータを書き直します (一時領域を {0} GB 使います)。
ko: {0}GB의 데이터를 다시 씁니다(임시 공간 {0}GB 사용).
pl: Spowoduje to ponowny zapis {0} GB danych (zajmie {0} GB miejsca tymczasowego).
pt: Isso regrava {0} GB de dados (usa {0} GB de espaço temporário).
ro: Se rescriu {0} GB de date (se utilizează {0} GB de spațiu temporar).
th: การดำเนินการนี้จะเขียนข้อมูล {0} GB ใหม่ (ใช้พื้นที่ชั่วคราว {0} GB)
tr: Bu işlem {0} GB veriyi yeniden yazar ({0} GB geçici alan kullanır).
uk: Буде перезаписано {0} ГБ даних (використовується {0} ГБ тимчасового місця).
vi: Thao tác này ghi lại {0} GB dữ liệu (dùng {0} GB dung lượng tạm).
zh_hans: 这将重写 {0} GB 的数据（使用 {0} GB 的临时空间）。
zh_hant: 這會重寫 {0} GB 的資料（使用 {0} GB 的暫存空間）。

# DataOp_RewriteRun
source: Run
ar: تشغيل
cs: Spustit
de: Ausführen
el: Εκτέλεση
es: Ejecutar
fa: اجرا
fr: Exécuter
hu: Futtatás
id: Jalankan
it: Esegui
ja: 実行する
ko: 실행
pl: Uruchom
pt: Executar
ro: Executare
th: เรียกใช้
tr: Çalıştır
uk: Виконати
vi: Chạy
zh_hans: 运行
zh_hant: 執行

# DataOp_NoPrevious
source: No data operation has been run yet.
ar: لم يتم تشغيل أي عملية بيانات بعد.
cs: Zatím nebyla provedena žádná datová operace.
de: Es wurde noch keine Datenoperation ausgeführt.
el: Δεν έχει εκτελεστεί ακόμη καμία πράξη δεδομένων.
es: Todavía no se ha ejecutado ninguna operación de datos.
fa: هنوز هیچ عملیات داده‌ای اجرا نشده است.
fr: Aucune opération sur les données n'a encore été exécutée.
hu: Még nem futott adatművelet.
id: Belum ada operasi data yang dijalankan.
it: Non è ancora stata eseguita alcuna operazione sui dati.
ja: まだデータ演算を実行していません。
ko: 아직 실행한 데이터 연산이 없습니다.
pl: Nie wykonano jeszcze żadnej operacji na danych.
pt: Nenhuma operação de dados foi executada ainda.
ro: Nu a fost executată încă nicio operație pe date.
th: ยังไม่มีการเรียกใช้การดำเนินการข้อมูล
tr: Henüz hiçbir veri işlemi çalıştırılmadı.
uk: Операції з даними ще не виконувалися.
vi: Chưa có phép toán dữ liệu nào được chạy.
zh_hans: 尚未运行任何数据运算。
zh_hant: 尚未執行任何資料運算。

# DataOp_Unchanged
source: The data does not change.
ar: لا تتغير البيانات.
cs: Data se nezmění.
de: Die Daten ändern sich nicht.
el: Τα δεδομένα δεν αλλάζουν.
es: Los datos no cambian.
fa: داده تغییر نمی‌کند.
fr: Les données ne changent pas.
hu: Az adatok nem változnak.
id: Data tidak berubah.
it: I dati non cambiano.
ja: データは変わりません。
ko: 데이터가 변경되지 않습니다.
pl: Dane się nie zmieniają.
pt: Os dados não mudam.
ro: Datele nu se modifică.
th: ข้อมูลไม่เปลี่ยนแปลง
tr: Veri değişmiyor.
uk: Дані не змінюються.
vi: Dữ liệu không thay đổi.
zh_hans: 数据不会更改。
zh_hant: 資料不會變更。

# DataOp_Result_Overflows
source: {0, plural, one {# element overflowed.} other {# elements overflowed.}}
ar: {0, plural, zero {تجاوز # عنصر الحد.} one {تجاوز عنصر واحد الحد.} two {تجاوز عنصران الحد.} few {تجاوزت # عناصر الحد.} many {تجاوز # عنصرًا الحد.} other {تجاوز # عنصر الحد.}}
cs: {0, plural, one {Přetekl # prvek.} few {Přetekly # prvky.} many {Přeteklo # prvku.} other {Přeteklo # prvků.}}
de: {0, plural, one {# Element ist übergelaufen.} other {# Elemente sind übergelaufen.}}
el: {0, plural, one {Υπερχείλισε # στοιχείο.} other {Υπερχείλισαν # στοιχεία.}}
es: {0, plural, one {Se desbordó # elemento.} other {Se desbordaron # elementos.}}
fa: {0, plural, one {# عنصر سرریز شد.} other {# عنصر سرریز شدند.}}
fr: {0, plural, one {# élément a débordé.} other {# éléments ont débordé.}}
hu: {0, plural, one {# elem túlcsordult.} other {# elem túlcsordult.}}
id: {0, plural, other {# elemen meluap.}}
it: {0, plural, one {Overflow in # elemento.} other {Overflow in # elementi.}}
ja: あふれた要素: {0} 個。
ko: {0, plural, other {요소 #개가 오버플로되었습니다.}}
pl: {0, plural, one {Przepełnienie w # elemencie.} few {Przepełnienie w # elementach.} many {Przepełnienie w # elementach.} other {Przepełnienie w # elementu.}}
pt: {0, plural, one {# elemento estourou.} other {# elementos estouraram.}}
ro: {0, plural, one {# element a depășit limitele.} few {# elemente au depășit limitele.} other {# de elemente au depășit limitele.}}
th: {0, plural, other {องค์ประกอบล้น # รายการ}}
tr: {0, plural, one {# öğe taştı.} other {# öğe taştı.}}
uk: {0, plural, one {Переповнення в # елементі.} few {Переповнення в # елементах.} many {Переповнення в # елементах.} other {Переповнення в # елемента.}}
vi: {0, plural, other {# phần tử bị tràn.}}
zh_hans: {0, plural, other {# 个元素溢出。}}
zh_hant: {0, plural, other {# 個元素溢位。}}

# DataOp_Result_NaN
source: NaN: {0}, infinity: {1}.
ar: NaN: {0}، اللانهاية: {1}.
cs: NaN: {0}, nekonečno: {1}.
de: NaN: {0}, Unendlich: {1}.
el: NaN: {0}, άπειρο: {1}.
es: NaN: {0}, infinito: {1}.
fa: NaN: {0}، بی‌نهایت: {1}.
fr: NaN : {0}, infini : {1}.
hu: NaN: {0}, végtelen: {1}.
id: NaN: {0}, tak hingga: {1}.
it: NaN: {0}, infinito: {1}.
ja: NaN: {0} 個、∞: {1} 個。
ko: NaN: {0}, 무한대: {1}.
pl: NaN: {0}, nieskończoność: {1}.
pt: NaN: {0}, infinito: {1}.
ro: NaN: {0}, infinit: {1}.
th: NaN: {0} อนันต์: {1}
tr: NaN: {0}, sonsuz: {1}.
uk: NaN: {0}, нескінченність: {1}.
vi: NaN: {0}, vô cực: {1}.
zh_hans: NaN：{0}，无穷大：{1}。
zh_hant: NaN：{0}，無限大：{1}。

# DataOp_Result_ZeroSkipped
source: {0, plural, one {# zero element was left unchanged.} other {# zero elements were left unchanged.}}
ar: {0, plural, zero {تُرك # عنصر صفري دون تغيير.} one {تُرك عنصر صفري واحد دون تغيير.} two {تُرك عنصران صفريان دون تغيير.} few {تُركت # عناصر صفرية دون تغيير.} many {تُرك # عنصرًا صفريًا دون تغيير.} other {تُرك # عنصر صفري دون تغيير.}}
cs: {0, plural, one {# nulový prvek zůstal beze změny.} few {# nulové prvky zůstaly beze změny.} many {# nulového prvku zůstalo beze změny.} other {# nulových prvků zůstalo beze změny.}}
de: {0, plural, one {# Nullelement blieb unverändert.} other {# Nullelemente blieben unverändert.}}
el: {0, plural, one {# μηδενικό στοιχείο έμεινε αμετάβλητο.} other {# μηδενικά στοιχεία έμειναν αμετάβλητα.}}
es: {0, plural, one {# elemento cero quedó sin cambios.} other {# elementos cero quedaron sin cambios.}}
fa: {0, plural, one {# عنصر صفر بدون تغییر ماند.} other {# عنصر صفر بدون تغییر ماندند.}}
fr: {0, plural, one {# élément nul n'a pas été modifié.} other {# éléments nuls n'ont pas été modifiés.}}
hu: {0, plural, one {# nulla értékű elem változatlan maradt.} other {# nulla értékű elem változatlan maradt.}}
id: {0, plural, other {# elemen nol dibiarkan tidak berubah.}}
it: {0, plural, one {# elemento zero è rimasto invariato.} other {# elementi zero sono rimasti invariati.}}
ja: 0 のため変えなかった要素: {0} 個。
ko: {0, plural, other {0인 요소 #개는 변경하지 않았습니다.}}
pl: {0, plural, one {# zerowy element pozostał bez zmian.} few {# zerowe elementy pozostały bez zmian.} many {# zerowych elementów pozostało bez zmian.} other {# zerowego elementu pozostało bez zmian.}}
pt: {0, plural, one {# elemento zero não foi alterado.} other {# elementos zero não foram alterados.}}
ro: {0, plural, one {# element zero a rămas nemodificat.} few {# elemente zero au rămas nemodificate.} other {# de elemente zero au rămas nemodificate.}}
th: {0, plural, other {องค์ประกอบที่เป็นศูนย์ # รายการไม่ถูกเปลี่ยน}}
tr: {0, plural, one {Sıfır olan # öğe değiştirilmedi.} other {Sıfır olan # öğe değiştirilmedi.}}
uk: {0, plural, one {# нульовий елемент залишено без змін.} few {# нульові елементи залишено без змін.} many {# нульових елементів залишено без змін.} other {# нульового елемента залишено без змін.}}
vi: {0, plural, other {# phần tử bằng 0 được giữ nguyên.}}
zh_hans: {0, plural, other {# 个零元素保持不变。}}
zh_hant: {0, plural, other {# 個零元素保持不變。}}

# DataOp_Result_Changed
source: {0, plural, one {# element changed.} other {# elements changed.}}
ar: {0, plural, zero {تغيّر # عنصر.} one {تغيّر عنصر واحد.} two {تغيّر عنصران.} few {تغيّرت # عناصر.} many {تغيّر # عنصرًا.} other {تغيّر # عنصر.}}
cs: {0, plural, one {Změněn # prvek.} few {Změněny # prvky.} many {Změněno # prvku.} other {Změněno # prvků.}}
de: {0, plural, one {# Element geändert.} other {# Elemente geändert.}}
el: {0, plural, one {Άλλαξε # στοιχείο.} other {Άλλαξαν # στοιχεία.}}
es: {0, plural, one {Cambió # elemento.} other {Cambiaron # elementos.}}
fa: {0, plural, one {# عنصر تغییر کرد.} other {# عنصر تغییر کردند.}}
fr: {0, plural, one {# élément modifié.} other {# éléments modifiés.}}
hu: {0, plural, one {# elem módosult.} other {# elem módosult.}}
id: {0, plural, other {# elemen diubah.}}
it: {0, plural, one {# elemento modificato.} other {# elementi modificati.}}
ja: 変更した要素: {0} 個。
ko: {0, plural, other {요소 #개가 변경되었습니다.}}
pl: {0, plural, one {Zmieniono # element.} few {Zmieniono # elementy.} many {Zmieniono # elementów.} other {Zmieniono # elementu.}}
pt: {0, plural, one {# elemento alterado.} other {# elementos alterados.}}
ro: {0, plural, one {S-a modificat # element.} few {S-au modificat # elemente.} other {S-au modificat # de elemente.}}
th: {0, plural, other {เปลี่ยนองค์ประกอบ # รายการแล้ว}}
tr: {0, plural, one {# öğe değişti.} other {# öğe değişti.}}
uk: {0, plural, one {Змінено # елемент.} few {Змінено # елементи.} many {Змінено # елементів.} other {Змінено # елемента.}}
vi: {0, plural, other {Đã thay đổi # phần tử.}}
zh_hans: {0, plural, other {已更改 # 个元素。}}
zh_hant: {0, plural, other {已變更 # 個元素。}}

# DataOp_Error_Float
source: Enter a number such as 0.5 or 1e-3 (use . as the decimal point).
ar: أدخل رقمًا مثل 0.5 أو 1e-3 (استخدم . كفاصلة عشرية).
cs: Zadejte číslo, například 0.5 nebo 1e-3 (jako desetinnou čárku použijte tečku).
de: Geben Sie eine Zahl wie 0.5 oder 1e-3 ein (verwenden Sie . als Dezimaltrennzeichen).
el: Εισαγάγετε έναν αριθμό όπως 0.5 ή 1e-3 (χρησιμοποιήστε . ως υποδιαστολή).
es: Escribe un número como 0.5 o 1e-3 (usa . como separador decimal).
fa: عددی مانند 0.5 یا 1e-3 وارد کنید (از . به‌عنوان ممیز استفاده کنید).
fr: Entrez un nombre tel que 0.5 ou 1e-3 (utilisez . comme séparateur décimal).
hu: Adjon meg egy számot, például 0.5 vagy 1e-3 (tizedesjelként a . karaktert használja).
id: Masukkan angka seperti 0.5 atau 1e-3 (gunakan . sebagai titik desimal).
it: Immetti un numero come 0.5 o 1e-3 (usa . come separatore decimale).
ja: 0.5 や 1e-3 のような数値を入力してください (小数点は . です)。
ko: 0.5 또는 1e-3 같은 숫자를 입력하세요(소수점은 . 사용).
pl: Wprowadź liczbę, np. 0.5 lub 1e-3 (użyj . jako separatora dziesiętnego).
pt: Insira um número como 0.5 ou 1e-3 (use . como separador decimal).
ro: Introduceți un număr precum 0.5 sau 1e-3 (utilizați . ca separator zecimal).
th: ป้อนตัวเลข เช่น 0.5 หรือ 1e-3 (ใช้ . เป็นจุดทศนิยม)
tr: 0.5 veya 1e-3 gibi bir sayı girin (ondalık ayırıcı olarak . kullanın).
uk: Введіть число, наприклад 0.5 або 1e-3 (як десятковий роздільник використовуйте крапку).
vi: Hãy nhập số như 0.5 hoặc 1e-3 (dùng . làm dấu thập phân).
zh_hans: 请输入 0.5 或 1e-3 这样的数值（使用 . 作为小数点）。
zh_hant: 請輸入數字，例如 0.5 或 1e-3（以 . 作為小數點）。

# DataOp_Error_Key
source: Enter a key.
ar: أدخل مفتاحًا.
cs: Zadejte klíč.
de: Geben Sie einen Schlüssel ein.
el: Εισαγάγετε ένα κλειδί.
es: Escribe una clave.
fa: کلیدی وارد کنید.
fr: Entrez une clé.
hu: Adjon meg egy kulcsot.
id: Masukkan kunci.
it: Immetti una chiave.
ja: 鍵を入力してください。
ko: 키를 입력하세요.
pl: Wprowadź klucz.
pt: Insira uma chave.
ro: Introduceți o cheie.
th: ป้อนคีย์
tr: Bir anahtar girin.
uk: Введіть ключ.
vi: Hãy nhập khóa.
zh_hans: 请输入密钥。
zh_hant: 請輸入金鑰。
